_/Chapter_10/PartF/ReservationBPEL/build/Partners/NorthAirWS/NorthAirWS.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.2_01-hudson-187-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.2_01-hudson-187-. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://northair.airalliance.org/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://northair.airalliance.org/" name="NorthAirWSService">
<wsp:UsingPolicy></wsp:UsingPolicy>
<wsp:Policy wsu:Id="NorthAirWSPortBinding_processItinerary_WSAT_Policy">
<wsp:ExactlyOne>
<wsp:All>
<ns1:ATAlwaysCapability xmlns:ns1="http://schemas.xmlsoap.org/ws/2004/10/wsat" wsp:Optional="false"></ns1:ATAlwaysCapability>
<ns2:ATAssertion xmlns:ns3="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns2="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns3:Optional="true" wsp:Optional="true"></ns2:ATAssertion>
</wsp:All>
</wsp:ExactlyOne>
</wsp:Policy>
<types>
<xsd:schema>
<xsd:import namespace="http://northair.airalliance.org/" schemaLocation="NorthAirWS_xsd_1.xsd"></xsd:import>
</xsd:schema>
</types>
<message name="processItinerary">
<part name="parameters" element="tns:processItinerary"></part>
</message>
<message name="processItineraryResponse">
<part name="parameters" element="tns:processItineraryResponse"></part>
</message>
<portType name="NorthAirWS">
<operation name="processItinerary">
<input message="tns:processItinerary"></input>
<output message="tns:processItineraryResponse"></output>
</operation>
</portType>
<binding name="NorthAirWSPortBinding" type="tns:NorthAirWS">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="processItinerary">
<wsp:PolicyReference URI="#NorthAirWSPortBinding_processItinerary_WSAT_Policy"></wsp:PolicyReference>
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="NorthAirWSService">
<port name="NorthAirWSPort" binding="tns:NorthAirWSPortBinding">
<soap:address location="http://localhost:8080/NorthAirWSService/NorthAirWS"></soap:address>
</port>
</service>
</definitions>