_/Chapter_10/PartC/AirAlliance_SA/test/TestReservation/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nor="http://northair.airalliance.org/">
  <soapenv:Body>
    <nor:processItinerary>
      <!--Optional:-->
      <firstName>Antony</firstName>
      <!--Optional:-->
      <lastName>Raj</lastName>
      <!--Optional:-->
      <source>MAS</source>
      <!--Optional:-->
      <destination>BLR</destination>
      <!--Optional:-->
      <travelDate>2008-03-04</travelDate>
      <!--Optional:-->
      <seatPreference>Win</seatPreference>
      <!--Optional:-->
      <foodPreference>Veg</foodPreference>
      <!--Optional:-->
      <guestID>g909</guestID>
      <seqID>23</seqID>
    </nor:processItinerary>
  </soapenv:Body>
</soapenv:Envelope>